notes/meeting_2022mar27.org
* meeting notes March 27, 2022
** the raku study group

** "Raku, Rust and Tidyverse"
*** Docker image to use raku with rstudio
*** https://github.com/sumanstats/rakurstudio

** an issue with "p6c" ecosystem
*** https://www.reddit.com/r/rakulang/comments/tdui4t/support_arbitrary_git_urls_as_raku_module/
*** https://www.reddit.com/r/rakulang/comments/tdui4t/support_arbitrary_git_urls_as_raku_module/i0m7yah/

** parrot raiser asks "how many lines of raku?"
*** https://www.theregister.com/2022/02/02/bash_wordle/

** later:
*** .trans allows regexs: how do ambiguous cases resolve?

** announcements 
*** April 10th: next raku study group meeting 
**** the week *before* easter
*** June 21-25: tprc: perl/raku conference 
