notes/meeting_2022mar27.md
- [meeting notes March 27, 2022](#org5c60743)
  - [the raku study group](#org50bb7b2)
  - ["Raku, Rust and Tidyverse"](#org67302c4)
    - [Docker image to use raku with rstudio](#org711ac59)
    - [<https://github.com/sumanstats/rakurstudio>](#org4a8774e)
  - [an issue with "p6c" ecosystem](#org54b4ec8)
    - [<https://www.reddit.com/r/rakulang/comments/tdui4t/support_arbitrary_git_urls_as_raku_module/>](#org24cf22e)
    - [<https://www.reddit.com/r/rakulang/comments/tdui4t/support_arbitrary_git_urls_as_raku_module/i0m7yah/>](#org84c4314)
  - [parrot raiser asks "how many lines of raku?"](#orgc261206)
    - [<https://www.theregister.com/2022/02/02/bash_wordle/>](#orge1fabe2)
  - [later:](#orgbf1aaa1)
    - [.trans allows regexs: how do ambiguous cases resolve?](#org3f42e53)
  - [announcements](#org0c0e56e)
    - [April 10th: next raku study group meeting](#orge9059a5)
    - [June 21-25: tprc: perl/raku conference](#org8f362f4)


<a id="org5c60743"></a>

# meeting notes March 27, 2022


<a id="org50bb7b2"></a>

## the raku study group


<a id="org67302c4"></a>

## "Raku, Rust and Tidyverse"


<a id="org711ac59"></a>

### Docker image to use raku with rstudio


<a id="org4a8774e"></a>

### <https://github.com/sumanstats/rakurstudio>


<a id="org54b4ec8"></a>

## an issue with "p6c" ecosystem


<a id="org24cf22e"></a>

### <https://www.reddit.com/r/rakulang/comments/tdui4t/support_arbitrary_git_urls_as_raku_module/>


<a id="org84c4314"></a>

### <https://www.reddit.com/r/rakulang/comments/tdui4t/support_arbitrary_git_urls_as_raku_module/i0m7yah/>


<a id="orgc261206"></a>

## parrot raiser asks "how many lines of raku?"


<a id="orge1fabe2"></a>

### <https://www.theregister.com/2022/02/02/bash_wordle/>


<a id="orgbf1aaa1"></a>

## later:


<a id="org3f42e53"></a>

### .trans allows regexs: how do ambiguous cases resolve?


<a id="org0c0e56e"></a>

## announcements


<a id="orge9059a5"></a>

### April 10th: next raku study group meeting

1.  the week **before** easter


<a id="org8f362f4"></a>

### June 21-25: tprc: perl/raku conference
